/*Создать объект класса Фотоальбом, используя классы Фотография, Страница.
Методы: задать название фотографии, дополнить фотоальбом фотографией,
вывести на консоль количество фотографий.
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello World!");


//        Albom albom = new Albom("her");
//        albom.addPhotoOnPage(1,"gavno");
//        albom.addPhotoOnPage(2,"gavno");
//        albom.setPhotoTitle("af", 2,1);
//
//        System.out.println(albom.proverkaFoto());
Kvadrat kvadrat=new Kvadrat(5,5,"gold");
        System.out.println(kvadrat.toString());
    }
}

